cases/openfoam.org/arbitraryCoupledMeshInterface/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          GAMG;
        tolerance       1e-3;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration no;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        maxIter         50;
    }

    pcorrFinal
    {
        $pcorr;
    }

    p
    {
        $pcorr;
        tolerance       1e-8;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-10;
        relTol          0;
    }

    "(S|U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0.1;
    }

    "(S|U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-12;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi          yes;
    momentumPredictor   yes;
    nOuterCorrectors    50;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    turbOnFinalIterOnly false;

    residualControl
    {
        p
        {   
            tolerance 5e-2;
            relTol 0;
        }
        U
        {
            tolerance 1e-3;
            relTol 0;
        }
        k
        {
            tolerance 1e-3;
            relTol 0;
        }
        epsilon
        {
            tolerance 1e-3;
            relTol 0;
        }
        
    }
}

relaxationFactors
{
    fields
    {
        p          0.5;
        pFinal     1;
    }
    equations
    {
        U           0.5;
        UFinal      1;
        k           0.5;
        kFinal      1;
        epsilon     0.5;
        epsilonFinal  1;
        S           0.5;
        SFinal      1;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
